# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

import random
n = int(input("Введите число кустов: "))

data = [random.randint(1,9) for i in range(1, n + 1)]
print(data)
harvest = []
harvest.append(data[0]+data[len(data)-1]+data[1])

for i in range(1,len(data)-2):
    harvest.append(data[i]+data[i-1]+data[i+1])
harvest.append(data[len(data)-1]+data[len(data)-2]+data[0])
print(harvest)
print(max(harvest))
